FlandreUNX/emmk-v5.1/hal/swm180x/SWM180_StdPeriph_Driver/SWM180_can.c
	if(format == CAN_FRAME_STD)
	{
		msg->id = (CANx->RXFRAME.DATA[0] << 3) | (CANx->RXFRAME.DATA[1] >> 5);
		
		for(i = 0; i < msg->size; i++)
		{
			msg->data[i] = CANx->RXFRAME.DATA[i+2];
		}
	}
	else //if(format == CAN_FRAME_EXT)
	{
		msg->id = (CANx->RXFRAME.DATA[0] << 21) | (CANx->RXFRAME.DATA[1] << 13) | (CANx->RXFRAME.DATA[2] << 5) | (CANx->RXFRAME.DATA[3] >> 3);
		
		for(i = 0; i < msg->size; i++)
		{
			msg->data[i] = CANx->RXFRAME.DATA[i+4];
		}
	}
	
	CANx->CMD = (1 << CAN_CMD_RRB_Pos);
}

/****************************************************************************************************************************************** 
* ��������:	CAN_TXComplete()
* ����˵��:	�����Ƿ����
* ��    ��: CAN_TypeDef * CANx	ָ��Ҫ�����õ�CAN�ӿڣ���Чֵ����CAN
* ��    ��: uint32_t			1 �Ѿ����    0 ��δ���
* ע������: ���ͱ�AbortҲ�ᴥ��������ɣ������ᴥ�����ͳɹ�
******************************************************************************************************************************************/
uint32_t CAN_TXComplete(CAN_TypeDef * CANx)
{
	return (CANx->SR & CAN_SR_TXBR_Msk) ? 1 : 0;
}

/****************************************************************************************************************************************** 
* ��������:	CAN_TXSuccess()
* ����˵��:	�����Ƿ�ɹ�
* ��    ��: CAN_TypeDef * CANx	ָ��Ҫ�����õ�CAN�ӿڣ���Чֵ����CAN
* ��    ��: uint32_t			1 ���ͳɹ�    0 ����ʧ��
* ע������: ��
******************************************************************************************************************************************/
uint32_t CAN_TXSuccess(CAN_TypeDef * CANx)
{
	return (CANx->SR & CAN_SR_TXOK_Msk) ? 1 : 0;
}

/****************************************************************************************************************************************** 
* ��������:	CAN_AbortTransmit()
* ����˵��:	��ֹ����
* ��    ��: CAN_TypeDef * CANx	ָ��Ҫ�����õ�CAN�ӿڣ���Чֵ����CAN
* ��    ��: ��
* ע������: ���ڽ��еķ����޷���ֹ����ִ�д������������ʧ�ܲ������ط�
******************************************************************************************************************************************/
void CAN_AbortTransmit(CAN_TypeDef * CANx)
{
	CANx->CMD = (1 << CAN_CMD_ABTTX_Pos);
}

/****************************************************************************************************************************************** 
* ��������:	CAN_TXBufferReady()
* ����˵��:	TX Buffer�Ƿ�׼���ÿ���д����Ϣ
* ��    ��: CAN_TypeDef * CANx	ָ��Ҫ�����õ�CAN�ӿڣ���Чֵ����CAN
* ��    ��: uint32_t			1 ��׼����    0 δ׼����
* ע������: ��
******************************************************************************************************************************************/
uint32_t CAN_TXBufferReady(CAN_TypeDef * CANx)
{
	return (CANx->SR & CAN_SR_TXBR_Msk) ? 1 : 0;
}

/****************************************************************************************************************************************** 
* ��������:	CAN_RXDataAvailable()
* ����˵��:	RX FIFO���Ƿ������ݿɶ���
* ��    ��: CAN_TypeDef * CANx	ָ��Ҫ�����õ�CAN�ӿڣ���Чֵ����CAN
* ��    ��: uint32_t			1 �����ݿɶ���    0 û������
* ע������: ��
******************************************************************************************************************************************/
uint32_t CAN_RXDataAvailable(CAN_TypeDef * CANx)
{
	return (CANx->SR & CAN_SR_RXDA_Msk) ? 1 : 0;
}

/****************************************************************************************************************************************** 
* ��������:	CAN_SetBaudrate()
* ����˵��:	���ò�����
* ��    ��: CAN_TypeDef * CANx	ָ��Ҫ�����õ�CAN�ӿڣ���Чֵ����CAN
*			uint32_t baudrate	�����ʣ���λ��������
*			uint32_t CAN_BS1	CAN_BS1_1tq��CAN_BS1_2tq��... ... ��CAN_BS1_16tq
*			uint32_t CAN_BS2	CAN_BS2_1tq��CAN_BS2_2tq��... ... ��CAN_BS2_8tq
*			uint32_t CAN_SJW	CAN_SJW_1tq��CAN_SJW_2tq��CAN_SJW_3tq��CAN_SJW_4tq
* ��    ��: ��
* ע������: ����ǰ��Ҫ�ȵ���CAN_Close()�ر�CANģ��
******************************************************************************************************************************************/
void CAN_SetBaudrate(CAN_TypeDef * CANx, uint32_t baudrate, uint32_t CAN_BS1, uint32_t CAN_BS2, uint32_t CAN_SJW)
{
	CANx->BT1 = (0 << CAN_BT1_SAM_Pos) |
				(CAN_BS1 << CAN_BT1_TSEG1_Pos) |
				(CAN_BS2 << CAN_BT1_TSEG2_Pos);
	
	CANx->BT0 = (CAN_SJW << CAN_BT0_SJW_Pos) |
				((SystemCoreClock/2/baudrate/(1 + (CAN_BS1 + 1) + (CAN_BS2 + 1)) - 1) << CAN_BT0_BRP_Pos);
}

/****************************************************************************************************************************************** 
* ��������:	CAN_SetFilter32b()
* ����˵��:	���ý����˲�����1��32λ�˲���
* ��    ��: CAN_TypeDef * CANx	ָ��Ҫ�����õ�CAN�ӿڣ���Чֵ����CAN
*			uint32_t check		��maskһ������˽��յ���Message�Ƿ����Լ���Ҫ�ģ�check & (~mask) == ID & (~mask)��Messageͨ������
*			uint32_t mask
* ��    ��: ��
* ע������: ����ǰ��Ҫ�ȵ���CAN_Close()�ر�CANģ��
******************************************************************************************************************************************/
void CAN_SetFilter32b(CAN_TypeDef * CANx, uint32_t check, uint32_t mask)
{
	CANx->CR &= ~CAN_CR_AFM_Msk;
	CANx->CR |= (CAN_FILTER_32b << CAN_CR_AFM_Pos);
	
	CANx->FILTER.AMR[0] =  mask & 0xFF;
	CANx->FILTER.AMR[1] = (mask >>  8) & 0xFF;
	CANx->FILTER.AMR[2] = (mask >> 16) & 0xFF;
	CANx->FILTER.AMR[3] = (mask >> 24) & 0xFF;
	
	CANx->FILTER.ACR[0] =  check & 0xFF;
	CANx->FILTER.ACR[1] = (check >>  8) & 0xFF;
	CANx->FILTER.ACR[2] = (check >> 16) & 0xFF;
	CANx->FILTER.ACR[3] = (check >> 24) & 0xFF;
}

/****************************************************************************************************************************************** 
* ��������:	CAN_SetFilter16b()
* ����˵��:	���ý����˲�����2��16λ�˲���
* ��    ��: CAN_TypeDef * CANx	ָ��Ҫ�����õ�CAN�ӿڣ���Чֵ����CAN
*			uint16_t check1		��maskһ������˽��յ���Message�Ƿ����Լ���Ҫ�ģ�check & (~mask) == ID & (~mask)��Messageͨ������
*			uint16_t mask1
*			uint16_t check2
*			uint16_t mask2
* ��    ��: ��
* ע������: ����ǰ��Ҫ�ȵ���CAN_Close()�ر�CANģ��
******************************************************************************************************************************************/
void CAN_SetFilter16b(CAN_TypeDef * CANx, uint16_t check1, uint16_t mask1, uint16_t check2, uint16_t mask2)
{
	CANx->CR &= ~CAN_CR_AFM_Msk;
	CANx->CR |= (CAN_FILTER_16b << CAN_CR_AFM_Pos);
	
	CANx->FILTER.AMR[0] =  mask1 & 0xFF;
	CANx->FILTER.AMR[1] = (mask1 >>  8) & 0xFF;
	CANx->FILTER.AMR[2] =  mask2 & 0xFF;
	CANx->FILTER.AMR[3] = (mask2 >>  8) & 0xFF;
	
	CANx->FILTER.ACR[0] =  check1 & 0xFF;
	CANx->FILTER.ACR[1] = (check1 >>  8) & 0xFF;
	CANx->FILTER.ACR[2] =  check2 & 0xFF;
	CANx->FILTER.ACR[3] = (check2 >>  8) & 0xFF;
}

/****************************************************************************************************************************************** 
* ��������:	CAN_INTRXNotEmptyEn()
* ����˵��:	��RX FIFO��������ʱ���ǿգ������ж�ʹ��
* ��    ��: CAN_TypeDef * CANx	ָ��Ҫ�����õ�CAN�ӿڣ���Чֵ����CAN
* ��    ��: ��
* ע������: ��
******************************************************************************************************************************************/
void CAN_INTRXNotEmptyEn(CAN_TypeDef * CANx)
{
	CANx->IE |= (1 << CAN_IE_RXDA_Pos);
}

/****************************************************************************************************************************************** 
* ��������:	CAN_INTRXNotEmptyDis()
* ����˵��:	��RX FIFO��������ʱ���ǿգ������жϽ�ֹ
* ��    ��: CAN_TypeDef * CANx	ָ��Ҫ�����õ�CAN�ӿڣ���Чֵ����CAN
* ��    ��: ��
* ע������: ��
******************************************************************************************************************************************/
void CAN_INTRXNotEmptyDis(CAN_TypeDef * CANx)
{
	CANx->IE &= ~(1 << CAN_IE_RXDA_Pos);
}

/****************************************************************************************************************************************** 
* ��������:	CAN_INTRXNotEmptyStat()
* ����˵��:	RX FIFO�ǿ��ж��Ƿ񴥷�
* ��    ��: CAN_TypeDef * CANx	ָ��Ҫ�����õ�CAN�ӿڣ���Чֵ����CAN
* ��    ��: uint32_t			1 �Ѵ���    0 δ����
* ע������: ��
******************************************************************************************************************************************/
uint32_t CAN_INTRXNotEmptyStat(CAN_TypeDef * CANx)
{
	return (CANx->IF & CAN_IF_RXDA_Msk) ? 1 : 0;
}

/****************************************************************************************************************************************** 
* ��������:	CAN_INTTXBufEmptyEn()
* ����˵��:	��TX Buffer��ʱ�����ж�ʹ��
* ��    ��: CAN_TypeDef * CANx	ָ��Ҫ�����õ�CAN�ӿڣ���Чֵ����CAN
* ��    ��: ��
* ע������: ��
******************************************************************************************************************************************/
void CAN_INTTXBufEmptyEn(CAN_TypeDef * CANx)
{
	CANx->IE |= (1 << CAN_IE_TXBR_Pos);
}

/****************************************************************************************************************************************** 
* ��������:	CAN_INTTXBufEmptyDis()
* ����˵��:	��TX Buffer��ʱ�����жϽ�ֹ
* ��    ��: CAN_TypeDef * CANx	ָ��Ҫ�����õ�CAN�ӿڣ���Чֵ����CAN
* ��    ��: ��
* ע������: ��
******************************************************************************************************************************************/
void CAN_INTTXBufEmptyDis(CAN_TypeDef * CANx)
{
	CANx->IE &= ~(1 << CAN_IE_TXBR_Pos);
}

/****************************************************************************************************************************************** 
* ��������:	CAN_INTTXBufEmptyStat()
* ����˵��:	TX Buffer���ж��Ƿ񴥷�
* ��    ��: CAN_TypeDef * CANx	ָ��Ҫ�����õ�CAN�ӿڣ���Чֵ����CAN
* ��    ��: uint32_t			1 �Ѵ���    0 δ����
* ע������: ��
******************************************************************************************************************************************/
uint32_t CAN_INTTXBufEmptyStat(CAN_TypeDef * CANx)
{
	return (CANx->IF & CAN_IF_TXBR_Msk) ? 1 : 0;
}

/****************************************************************************************************************************************** 
* ��������:	CAN_INTErrWarningEn()
* ����˵��:	TXERR/RXERR����ֵ�ﵽError Warning Limitʱ�����ж�ʹ��
* ��    ��: CAN_TypeDef * CANx	ָ��Ҫ�����õ�CAN�ӿڣ���Чֵ����CAN
* ��    ��: ��
* ע������: ��
******************************************************************************************************************************************/
void CAN_INTErrWarningEn(CAN_TypeDef * CANx)
{
	CANx->IE |= (1 << CAN_IE_ERRWARN_Pos);
}

/****************************************************************************************************************************************** 
* ��������:	CAN_INTErrWarningDis()
* ����˵��:	TXERR/RXERR����ֵ�ﵽError Warning Limitʱ�����жϽ�ֹ
* ��    ��: CAN_TypeDef * CANx	ָ��Ҫ�����õ�CAN�ӿڣ���Чֵ����CAN
* ��    ��: ��
* ע������: ��
******************************************************************************************************************************************/
void CAN_INTErrWarningDis(CAN_TypeDef * CANx)
{
	CANx->IE &= ~(1 << CAN_IE_ERRWARN_Pos);
}

/****************************************************************************************************************************************** 
* ��������:	CAN_INTErrWarningStat()
* ����˵��:	TXERR/RXERR����ֵ�ﵽError Warning Limit�ж��Ƿ񴥷�
* ��    ��: CAN_TypeDef * CANx	ָ��Ҫ�����õ�CAN�ӿڣ���Чֵ����CAN
* ��    ��: uint32_t			1 �Ѵ���    0 δ����
* ע������: ��
******************************************************************************************************************************************/
uint32_t CAN_INTErrWarningStat(CAN_TypeDef * CANx)
{
	return (CANx->IF & CAN_IF_ERRWARN_Msk) ? 1 : 0;
}

/****************************************************************************************************************************************** 
* ��������:	CAN_INTRXOverflowEn()
* ����˵��:	RX FIFO ���ʱ�����ж�ʹ��
* ��    ��: CAN_TypeDef * CANx	ָ��Ҫ�����õ�CAN�ӿڣ���Чֵ����CAN
* ��    ��: ��
* ע������: ��
******************************************************************************************************************************************/
void CAN_INTRXOverflowEn(CAN_TypeDef * CANx)
{
	CANx->IE |= (1 << CAN_IE_RXOV_Pos);
}

/****************************************************************************************************************************************** 
* ��������:	CAN_INTRXOverflowDis()
* ����˵��:	RX FIFO ���ʱ�����жϽ�ֹ
* ��    ��: CAN_TypeDef * CANx	ָ��Ҫ�����õ�CAN�ӿڣ���Чֵ����CAN
* ��    ��: ��
* ע������: ��
******************************************************************************************************************************************/
void CAN_INTRXOverflowDis(CAN_TypeDef * CANx)
{
	CANx->IE &= ~(1 << CAN_IE_RXOV_Pos);
}

/****************************************************************************************************************************************** 
* ��������:	CAN_INTRXOverflowStat()
* ����˵��:	RX FIFO ����ж��Ƿ񴥷�
* ��    ��: CAN_TypeDef * CANx	ָ��Ҫ�����õ�CAN�ӿڣ���Чֵ����CAN
* ��    ��: uint32_t			1 �Ѵ���    0 δ����
* ע������: ��
******************************************************************************************************************************************/
uint32_t CAN_INTRXOverflowStat(CAN_TypeDef * CANx)
{
	return (CANx->IF & CAN_IF_RXOV_Msk) ? 1 : 0;
}

/****************************************************************************************************************************************** 
* ��������:	CAN_INTRXOverflowClear()
* ����˵��:	RX FIFO ����ж����
* ��    ��: CAN_TypeDef * CANx	ָ��Ҫ�����õ�CAN�ӿڣ���Чֵ����CAN
* ��    ��: ��
* ע������: ��
******************************************************************************************************************************************/
void CAN_INTRXOverflowClear(CAN_TypeDef * CANx)
{
	CANx->CMD = (1 << CAN_CMD_CLROV_Pos);
}

/****************************************************************************************************************************************** 
* ��������:	CAN_INTWakeupEn()
* ����˵��:	�����¼������ж�ʹ��
* ��    ��: CAN_TypeDef * CANx	ָ��Ҫ�����õ�CAN�ӿڣ���Чֵ����CAN
* ��    ��: ��
* ע������: ��
******************************************************************************************************************************************/
void CAN_INTWakeupEn(CAN_TypeDef * CANx)
{
	CANx->IE |= (1 << CAN_IE_WKUP_Pos);
}

/****************************************************************************************************************************************** 
* ��������:	CAN_INTWakeupDis()
* ����˵��:	�����¼������жϽ�ֹ
* ��    ��: CAN_TypeDef * CANx	ָ��Ҫ�����õ�CAN�ӿڣ���Чֵ����CAN
* ��    ��: ��
* ע������: ��
******************************************************************************************************************************************/
void CAN_INTWakeupDis(CAN_TypeDef * CANx)
{
	CANx->IE &= ~(1 << CAN_IE_WKUP_Pos);
}

/****************************************************************************************************************************************** 
* ��������:	CAN_INTWakeupStat()
* ����˵��:	�����¼��ж��Ƿ񴥷�
* ��    ��: CAN_TypeDef * CANx	ָ��Ҫ�����õ�CAN�ӿڣ���Чֵ����CAN
* ��    ��: uint32_t			1 �Ѵ���    0 δ����
* ע������: ��
******************************************************************************************************************************************/
uint32_t CAN_INTWakeupStat(CAN_TypeDef * CANx)
{
	return (CANx->IF & CAN_IF_WKUP_Msk) ? 1 : 0;
}

/****************************************************************************************************************************************** 
* ��������:	CAN_INTErrPassiveEn()
* ����˵��:	TXERR/RXERR����ֵ�ﵽ127ʱ�ж�ʹ��
* ��    ��: CAN_TypeDef * CANx	ָ��Ҫ�����õ�CAN�ӿڣ���Чֵ����CAN
* ��    ��: ��
* ע������: ��
******************************************************************************************************************************************/
void CAN_INTErrPassiveEn(CAN_TypeDef * CANx)
{
	CANx->IE |= (1 << CAN_IE_ERRPASS_Pos);
}

/****************************************************************************************************************************************** 
* ��������:	CAN_INTErrPassiveDis()
* ����˵��:	TXERR/RXERR����ֵ�ﵽ127ʱ�жϽ�ֹ
* ��    ��: CAN_TypeDef * CANx	ָ��Ҫ�����õ�CAN�ӿڣ���Чֵ����CAN
* ��    ��: ��
* ע������: ��
******************************************************************************************************************************************/
void CAN_INTErrPassiveDis(CAN_TypeDef * CANx)
{
	CANx->IE &= ~(1 << CAN_IE_ERRPASS_Pos);
}

/****************************************************************************************************************************************** 
* ��������:	CAN_INTErrPassiveStat()
* ����˵��:	TXERR/RXERR����ֵ�ﵽ127�ж��Ƿ񴥷�
* ��    ��: CAN_TypeDef * CANx	ָ��Ҫ�����õ�CAN�ӿڣ���Чֵ����CAN
* ��    ��: uint32_t			1 �Ѵ���    0 δ����
* ע������: ��
******************************************************************************************************************************************/
uint32_t CAN_INTErrPassiveStat(CAN_TypeDef * CANx)
{
	return (CANx->IF & CAN_IF_ERRPASS_Msk) ? 1 : 0;
}

/****************************************************************************************************************************************** 
* ��������:	CAN_INTArbitrLostEn()
* ����˵��:	�ٲ�ʧ���ж�ʹ��
* ��    ��: CAN_TypeDef * CANx	ָ��Ҫ�����õ�CAN�ӿڣ���Чֵ����CAN
* ��    ��: ��
* ע������: ��
******************************************************************************************************************************************/
void CAN_INTArbitrLostEn(CAN_TypeDef * CANx)
{
	CANx->IE |= (1 << CAN_IE_ARBLOST_Pos);
}

/****************************************************************************************************************************************** 
* ��������:	CAN_INTArbitrLostDis()
* ����˵��:	�ٲ�ʧ���жϽ�ֹ
* ��    ��: CAN_TypeDef * CANx	ָ��Ҫ�����õ�CAN�ӿڣ���Чֵ����CAN
* ��    ��: ��
* ע������: ��
******************************************************************************************************************************************/
void CAN_INTArbitrLostDis(CAN_TypeDef * CANx)
{
	CANx->IE &= ~(1 << CAN_IE_ARBLOST_Pos);
}

/****************************************************************************************************************************************** 
* ��������:	CAN_INTArbitrLostStat()
* ����˵��:	�ٲ�ʧ���ж��Ƿ񴥷�
* ��    ��: CAN_TypeDef * CANx	ָ��Ҫ�����õ�CAN�ӿڣ���Чֵ����CAN
* ��    ��: uint32_t			1 �Ѵ���    0 δ����
* ע������: ��
******************************************************************************************************************************************/
uint32_t CAN_INTArbitrLostStat(CAN_TypeDef * CANx)
{
	return (CANx->IF & CAN_IF_ARBLOST_Msk) ? 1 : 0;
}

/****************************************************************************************************************************************** 
* ��������:	CAN_INTBusErrorEn()
* ����˵��:	���ߴ����ж�ʹ��
* ��    ��: CAN_TypeDef * CANx	ָ��Ҫ�����õ�CAN�ӿڣ���Чֵ����CAN
* ��    ��: ��
* ע������: ��
******************************************************************************************************************************************/
void CAN_INTBusErrorEn(CAN_TypeDef * CANx)
{
	CANx->IE |= (1 << CAN_IE_BUSERR_Pos);
}

/****************************************************************************************************************************************** 
* ��������:	CAN_INTBusErrorDis()
* ����˵��:	���ߴ����жϽ�ֹ
* ��    ��: CAN_TypeDef * CANx	ָ��Ҫ�����õ�CAN�ӿڣ���Чֵ����CAN
* ��    ��: ��
* ע������: ��
******************************************************************************************************************************************/
void CAN_INTBusErrorDis(CAN_TypeDef * CANx)
{
	CANx->IE &= ~(1 << CAN_IE_BUSERR_Pos);
}

/****************************************************************************************************************************************** 
* ��������:	CAN_INTBusErrorStat()
* ����˵��:	���ߴ����ж��Ƿ񴥷�
* ��    ��: CAN_TypeDef * CANx	ָ��Ҫ�����õ�CAN�ӿڣ���Чֵ����CAN
* ��    ��: uint32_t			1 �Ѵ���    0 δ����
* ע������: ��
******************************************************************************************************************************************/
uint32_t CAN_INTBusErrorStat(CAN_TypeDef * CANx)
{
	return (CANx->IF & CAN_IF_BUSERR_Msk) ? 1 : 0;
}
